#+TITLE: orz

* Usage

** Setup

#+BEGIN_SRC
npm install
#+END_SRC

** Build

#+BEGIN_SRC
npm run build
#+END_SRC

** Versions

#+BEGIN_SRC shell
node -v
#+END_SRC

#+RESULTS:
: v12.6.0

#+BEGIN_SRC shell
npm -v
#+END_SRC

#+RESULTS:
: 6.11.3

** Release

#+BEGIN_SRC shell
npm archive
#+END_SRC

#+BEGIN_SRC shell
VERSION=`date +'v%Y%m%d.%H%M'` && hub release create -a ./dist.tar.gz -m "$VERSION" "$VERSION"
#+END_SRC

* Reference

- https://codepen.io/short/pen/VyNqPa
